mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1c3xb/common/s6e1c3xb.h
/*******************************************************************************
* EXTI_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t ENIR;
        stc_exti_enir_field_t ENIR_f;
        struct {
          union {
            __IO uint16_t ENIRL;
            struct {
              __IO uint8_t ENIRLL;
              __IO uint8_t ENIRLH;
            };
          };
          union {
            __IO uint16_t ENIRH;
            struct {
              __IO uint8_t ENIRHL;
              __IO uint8_t ENIRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t EIRR;
        stc_exti_eirr_field_t EIRR_f;
        struct {
          union {
            __IO uint16_t EIRRL;
            struct {
              __IO uint8_t EIRRLL;
              __IO uint8_t EIRRLH;
            };
          };
          union {
            __IO uint16_t EIRRH;
            struct {
              __IO uint8_t EIRRHL;
              __IO uint8_t EIRRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t EICL;
        stc_exti_eicl_field_t EICL_f;
        struct {
          union {
            __IO uint16_t EICLL;
            struct {
              __IO uint8_t EICLLL;
              __IO uint8_t EICLLH;
            };
          };
          union {
            __IO uint16_t EICLH;
            struct {
              __IO uint8_t EICLHL;
              __IO uint8_t EICLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t ELVR;
        stc_exti_elvr_field_t ELVR_f;
        struct {
          union {
            __IO uint16_t ELVRL;
            struct {
              __IO uint8_t ELVRLL;
              __IO uint8_t ELVRLH;
            };
          };
          union {
            __IO uint16_t ELVRH;
            struct {
              __IO uint8_t ELVRHL;
              __IO uint8_t ELVRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t ELVR1;
        stc_exti_elvr1_field_t ELVR1_f;
        struct {
          union {
            __IO uint16_t ELVR1L;
            struct {
              __IO uint8_t ELVR1LL;
              __IO uint8_t ELVR1LH;
            };
          };
          union {
            __IO uint16_t ELVR1H;
            struct {
              __IO uint8_t ELVR1HL;
              __IO uint8_t ELVR1HH;
            };
          };
        };
    };
    union {
        __IO uint16_t NMIRR;
        stc_exti_nmirr_field_t NMIRR_f;
        struct {
            __IO  uint8_t NMIRRL;
            __IO  uint8_t NMIRRH;
        };
    };
        __IO  uint8_t RESERVED0[2];
    union {
        __IO uint16_t NMICL;
        stc_exti_nmicl_field_t NMICL_f;
        struct {
            __IO  uint8_t NMICLL;
            __IO  uint8_t NMICLH;
        };
    };
        __IO  uint8_t RESERVED1[2];
    union {
        __IO uint32_t ELVR2;
        stc_exti_elvr2_field_t ELVR2_f;
        struct {
          union {
            __IO uint16_t ELVR2L;
            struct {
              __IO uint8_t ELVR2LL;
              __IO uint8_t ELVR2LH;
            };
          };
          union {
            __IO uint16_t ELVR2H;
            struct {
              __IO uint8_t ELVR2HL;
              __IO uint8_t ELVR2HH;
            };
          };
        };
    };
    union {
        __IO  uint8_t NMIENR;
        stc_exti_nmienr_field_t NMIENR_f;
    };
} FM_EXTI_TypeDef, FM0P_EXTI_TypeDef;

/*******************************************************************************
* FASTIO_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t FPDIR0;
        stc_fastio_fpdir0_field_t FPDIR0_f;
        struct {
          union {
            __IO uint16_t FPDIR0L;
            struct {
              __IO uint8_t FPDIR0LL;
              __IO uint8_t FPDIR0LH;
            };
          };
          union {
            __IO uint16_t FPDIR0H;
            struct {
              __IO uint8_t FPDIR0HL;
              __IO uint8_t FPDIR0HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDIR1;
        stc_fastio_fpdir1_field_t FPDIR1_f;
        struct {
          union {
            __IO uint16_t FPDIR1L;
            struct {
              __IO uint8_t FPDIR1LL;
              __IO uint8_t FPDIR1LH;
            };
          };
          union {
            __IO uint16_t FPDIR1H;
            struct {
              __IO uint8_t FPDIR1HL;
              __IO uint8_t FPDIR1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDIR2;
        stc_fastio_fpdir2_field_t FPDIR2_f;
        struct {
          union {
            __IO uint16_t FPDIR2L;
            struct {
              __IO uint8_t FPDIR2LL;
              __IO uint8_t FPDIR2LH;
            };
          };
          union {
            __IO uint16_t FPDIR2H;
            struct {
              __IO uint8_t FPDIR2HL;
              __IO uint8_t FPDIR2HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDIR3;
        stc_fastio_fpdir3_field_t FPDIR3_f;
        struct {
          union {
            __IO uint16_t FPDIR3L;
            struct {
              __IO uint8_t FPDIR3LL;
              __IO uint8_t FPDIR3LH;
            };
          };
          union {
            __IO uint16_t FPDIR3H;
            struct {
              __IO uint8_t FPDIR3HL;
              __IO uint8_t FPDIR3HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDIR4;
        stc_fastio_fpdir4_field_t FPDIR4_f;
        struct {
          union {
            __IO uint16_t FPDIR4L;
            struct {
              __IO uint8_t FPDIR4LL;
              __IO uint8_t FPDIR4LH;
            };
          };
          union {
            __IO uint16_t FPDIR4H;
            struct {
              __IO uint8_t FPDIR4HL;
              __IO uint8_t FPDIR4HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDIR5;
        stc_fastio_fpdir5_field_t FPDIR5_f;
        struct {
          union {
            __IO uint16_t FPDIR5L;
            struct {
              __IO uint8_t FPDIR5LL;
              __IO uint8_t FPDIR5LH;
            };
          };
          union {
            __IO uint16_t FPDIR5H;
            struct {
              __IO uint8_t FPDIR5HL;
              __IO uint8_t FPDIR5HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDIR6;
        stc_fastio_fpdir6_field_t FPDIR6_f;
        struct {
          union {
            __IO uint16_t FPDIR6L;
            struct {
              __IO uint8_t FPDIR6LL;
              __IO uint8_t FPDIR6LH;
            };
          };
          union {
            __IO uint16_t FPDIR6H;
            struct {
              __IO uint8_t FPDIR6HL;
              __IO uint8_t FPDIR6HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDIR7;
        struct {
          union {
            __IO uint16_t FPDIR7L;
            struct {
              __IO uint8_t FPDIR7LL;
              __IO uint8_t FPDIR7LH;
            };
          };
          union {
            __IO uint16_t FPDIR7H;
            struct {
              __IO uint8_t FPDIR7HL;
              __IO uint8_t FPDIR7HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDIR8;
        stc_fastio_fpdir8_field_t FPDIR8_f;
        struct {
          union {
            __IO uint16_t FPDIR8L;
            struct {
              __IO uint8_t FPDIR8LL;
              __IO uint8_t FPDIR8LH;
            };
          };
          union {
            __IO uint16_t FPDIR8H;
            struct {
              __IO uint8_t FPDIR8HL;
              __IO uint8_t FPDIR8HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDIR9;
        struct {
          union {
            __IO uint16_t FPDIR9L;
            struct {
              __IO uint8_t FPDIR9LL;
              __IO uint8_t FPDIR9LH;
            };
          };
          union {
            __IO uint16_t FPDIR9H;
            struct {
              __IO uint8_t FPDIR9HL;
              __IO uint8_t FPDIR9HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDIRA;
        struct {
          union {
            __IO uint16_t FPDIRAL;
            struct {
              __IO uint8_t FPDIRALL;
              __IO uint8_t FPDIRALH;
            };
          };
          union {
            __IO uint16_t FPDIRAH;
            struct {
              __IO uint8_t FPDIRAHL;
              __IO uint8_t FPDIRAHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDIRB;
        struct {
          union {
            __IO uint16_t FPDIRBL;
            struct {
              __IO uint8_t FPDIRBLL;
              __IO uint8_t FPDIRBLH;
            };
          };
          union {
            __IO uint16_t FPDIRBH;
            struct {
              __IO uint8_t FPDIRBHL;
              __IO uint8_t FPDIRBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDIRC;
        struct {
          union {
            __IO uint16_t FPDIRCL;
            struct {
              __IO uint8_t FPDIRCLL;
              __IO uint8_t FPDIRCLH;
            };
          };
          union {
            __IO uint16_t FPDIRCH;
            struct {
              __IO uint8_t FPDIRCHL;
              __IO uint8_t FPDIRCHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDIRD;
        struct {
          union {
            __IO uint16_t FPDIRDL;
            struct {
              __IO uint8_t FPDIRDLL;
              __IO uint8_t FPDIRDLH;
            };
          };
          union {
            __IO uint16_t FPDIRDH;
            struct {
              __IO uint8_t FPDIRDHL;
              __IO uint8_t FPDIRDHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDIRE;
        stc_fastio_fpdire_field_t FPDIRE_f;
        struct {
          union {
            __IO uint16_t FPDIREL;
            struct {
              __IO uint8_t FPDIRELL;
              __IO uint8_t FPDIRELH;
            };
          };
          union {
            __IO uint16_t FPDIREH;
            struct {
              __IO uint8_t FPDIREHL;
              __IO uint8_t FPDIREHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDIRF;
        struct {
          union {
            __IO uint16_t FPDIRFL;
            struct {
              __IO uint8_t FPDIRFLL;
              __IO uint8_t FPDIRFLH;
            };
          };
          union {
            __IO uint16_t FPDIRFH;
            struct {
              __IO uint8_t FPDIRFHL;
              __IO uint8_t FPDIRFHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDOR0;
        stc_fastio_fpdor0_field_t FPDOR0_f;
        struct {
          union {
            __IO uint16_t FPDOR0L;
            struct {
              __IO uint8_t FPDOR0LL;
              __IO uint8_t FPDOR0LH;
            };
          };
          union {
            __IO uint16_t FPDOR0H;
            struct {
              __IO uint8_t FPDOR0HL;
              __IO uint8_t FPDOR0HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDOR1;
        stc_fastio_fpdor1_field_t FPDOR1_f;
        struct {
          union {
            __IO uint16_t FPDOR1L;
            struct {
              __IO uint8_t FPDOR1LL;
              __IO uint8_t FPDOR1LH;
            };
          };
          union {
            __IO uint16_t FPDOR1H;
            struct {
              __IO uint8_t FPDOR1HL;
              __IO uint8_t FPDOR1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDOR2;
        stc_fastio_fpdor2_field_t FPDOR2_f;
        struct {
          union {
            __IO uint16_t FPDOR2L;
            struct {
              __IO uint8_t FPDOR2LL;
              __IO uint8_t FPDOR2LH;
            };
          };
          union {
            __IO uint16_t FPDOR2H;
            struct {
              __IO uint8_t FPDOR2HL;
              __IO uint8_t FPDOR2HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDOR3;
        stc_fastio_fpdor3_field_t FPDOR3_f;
        struct {
          union {
            __IO uint16_t FPDOR3L;
            struct {
              __IO uint8_t FPDOR3LL;
              __IO uint8_t FPDOR3LH;
            };
          };
          union {
            __IO uint16_t FPDOR3H;
            struct {
              __IO uint8_t FPDOR3HL;
              __IO uint8_t FPDOR3HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDOR4;
        stc_fastio_fpdor4_field_t FPDOR4_f;
        struct {
          union {
            __IO uint16_t FPDOR4L;
            struct {
              __IO uint8_t FPDOR4LL;
              __IO uint8_t FPDOR4LH;
            };
          };
          union {
            __IO uint16_t FPDOR4H;
            struct {
              __IO uint8_t FPDOR4HL;
              __IO uint8_t FPDOR4HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDOR5;
        stc_fastio_fpdor5_field_t FPDOR5_f;
        struct {
          union {
            __IO uint16_t FPDOR5L;
            struct {
              __IO uint8_t FPDOR5LL;
              __IO uint8_t FPDOR5LH;
            };
          };
          union {
            __IO uint16_t FPDOR5H;
            struct {
              __IO uint8_t FPDOR5HL;
              __IO uint8_t FPDOR5HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDOR6;
        stc_fastio_fpdor6_field_t FPDOR6_f;
        struct {
          union {
            __IO uint16_t FPDOR6L;
            struct {
              __IO uint8_t FPDOR6LL;
              __IO uint8_t FPDOR6LH;
            };
          };
          union {
            __IO uint16_t FPDOR6H;
            struct {
              __IO uint8_t FPDOR6HL;
              __IO uint8_t FPDOR6HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDOR7;
        struct {
          union {
            __IO uint16_t FPDOR7L;
            struct {
              __IO uint8_t FPDOR7LL;
              __IO uint8_t FPDOR7LH;
            };
          };
          union {
            __IO uint16_t FPDOR7H;
            struct {
              __IO uint8_t FPDOR7HL;
              __IO uint8_t FPDOR7HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDOR8;
        stc_fastio_fpdor8_field_t FPDOR8_f;
        struct {
          union {
            __IO uint16_t FPDOR8L;
            struct {
              __IO uint8_t FPDOR8LL;
              __IO uint8_t FPDOR8LH;
            };
          };
          union {
            __IO uint16_t FPDOR8H;
            struct {
              __IO uint8_t FPDOR8HL;
              __IO uint8_t FPDOR8HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDOR9;
        struct {
          union {
            __IO uint16_t FPDOR9L;
            struct {
              __IO uint8_t FPDOR9LL;
              __IO uint8_t FPDOR9LH;
            };
          };
          union {
            __IO uint16_t FPDOR9H;
            struct {
              __IO uint8_t FPDOR9HL;
              __IO uint8_t FPDOR9HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDORA;
        struct {
          union {
            __IO uint16_t FPDORAL;
            struct {
              __IO uint8_t FPDORALL;
              __IO uint8_t FPDORALH;
            };
          };
          union {
            __IO uint16_t FPDORAH;
            struct {
              __IO uint8_t FPDORAHL;
              __IO uint8_t FPDORAHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDORB;
        struct {
          union {
            __IO uint16_t FPDORBL;
            struct {
              __IO uint8_t FPDORBLL;
              __IO uint8_t FPDORBLH;
            };
          };
          union {
            __IO uint16_t FPDORBH;
            struct {
              __IO uint8_t FPDORBHL;
              __IO uint8_t FPDORBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDORC;
        struct {
          union {
            __IO uint16_t FPDORCL;
            struct {
              __IO uint8_t FPDORCLL;
              __IO uint8_t FPDORCLH;
            };
          };
          union {
            __IO uint16_t FPDORCH;
            struct {
              __IO uint8_t FPDORCHL;
              __IO uint8_t FPDORCHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDORD;
        struct {
          union {
            __IO uint16_t FPDORDL;
            struct {
              __IO uint8_t FPDORDLL;
              __IO uint8_t FPDORDLH;
            };
          };
          union {
            __IO uint16_t FPDORDH;
            struct {
              __IO uint8_t FPDORDHL;
              __IO uint8_t FPDORDHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDORE;
        stc_fastio_fpdore_field_t FPDORE_f;
        struct {
          union {
            __IO uint16_t FPDOREL;
            struct {
              __IO uint8_t FPDORELL;
              __IO uint8_t FPDORELH;
            };
          };
          union {
            __IO uint16_t FPDOREH;
            struct {
              __IO uint8_t FPDOREHL;
              __IO uint8_t FPDOREHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPDORF;
        struct {
          union {
            __IO uint16_t FPDORFL;
            struct {
              __IO uint8_t FPDORFLL;
              __IO uint8_t FPDORFLH;
            };
          };
          union {
            __IO uint16_t FPDORFH;
            struct {
              __IO uint8_t FPDORFHL;
              __IO uint8_t FPDORFHH;
            };
          };
        };
    };
    union {
        __IO uint32_t M_FPDIR0;
        stc_fastio_m_fpdir0_field_t M_FPDIR0_f;
        struct {
          union {
            __IO uint16_t M_FPDIR0L;
            struct {
              __IO uint8_t M_FPDIR0LL;
              __IO uint8_t M_FPDIR0LH;
            };
          };
          union {
            __IO uint16_t M_FPDIR0H;
            struct {
              __IO uint8_t M_FPDIR0HL;
              __IO uint8_t M_FPDIR0HH;
            };
          };
        };
    };
    union {
        __IO uint32_t M_FPDIR1;
        stc_fastio_m_fpdir1_field_t M_FPDIR1_f;
        struct {
          union {
            __IO uint16_t M_FPDIR1L;
            struct {
              __IO uint8_t M_FPDIR1LL;
              __IO uint8_t M_FPDIR1LH;
            };
          };
          union {
            __IO uint16_t M_FPDIR1H;
            struct {
              __IO uint8_t M_FPDIR1HL;
              __IO uint8_t M_FPDIR1HH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED0[56];
    union {
        __IO uint32_t M_FPDOR0;
        stc_fastio_m_fpdor0_field_t M_FPDOR0_f;
        struct {
          union {
            __IO uint16_t M_FPDOR0L;
            struct {
              __IO uint8_t M_FPDOR0LL;
              __IO uint8_t M_FPDOR0LH;
            };
          };
          union {
            __IO uint16_t M_FPDOR0H;
            struct {
              __IO uint8_t M_FPDOR0HL;
              __IO uint8_t M_FPDOR0HH;
            };
          };
        };
    };
    union {
        __IO uint32_t M_FPDOR1;
        stc_fastio_m_fpdor1_field_t M_FPDOR1_f;
        struct {
          union {
            __IO uint16_t M_FPDOR1L;
            struct {
              __IO uint8_t M_FPDOR1LL;
              __IO uint8_t M_FPDOR1LH;
            };
          };
          union {
            __IO uint16_t M_FPDOR1H;
            struct {
              __IO uint8_t M_FPDOR1HL;
              __IO uint8_t M_FPDOR1HH;
            };
          };
        };
    };
} FM_FASTIO_TypeDef, FM0P_FASTIO_TypeDef;

