mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1c3xb/common/s6e1c3xb.h
              __IO uint8_t EPFR23HH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED12[28];
    union {
        __IO uint32_t EPFR31;
        stc_gpio_epfr31_field_t EPFR31_f;
        struct {
          union {
            __IO uint16_t EPFR31L;
            struct {
              __IO uint8_t EPFR31LL;
              __IO uint8_t EPFR31LH;
            };
          };
          union {
            __IO uint16_t EPFR31H;
            struct {
              __IO uint8_t EPFR31HL;
              __IO uint8_t EPFR31HH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED13[4];
    union {
        __IO uint32_t EPFR33;
        stc_gpio_epfr33_field_t EPFR33_f;
        struct {
          union {
            __IO uint16_t EPFR33L;
            struct {
              __IO uint8_t EPFR33LL;
              __IO uint8_t EPFR33LH;
            };
          };
          union {
            __IO uint16_t EPFR33H;
            struct {
              __IO uint8_t EPFR33HL;
              __IO uint8_t EPFR33HH;
            };
          };
        };
    };
    union {
        __IO uint32_t EPFR34;
        stc_gpio_epfr34_field_t EPFR34_f;
        struct {
          union {
            __IO uint16_t EPFR34L;
            struct {
              __IO uint8_t EPFR34LL;
              __IO uint8_t EPFR34LH;
            };
          };
          union {
            __IO uint16_t EPFR34H;
            struct {
              __IO uint8_t EPFR34HL;
              __IO uint8_t EPFR34HH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED14[8];
    union {
        __IO uint32_t EPFR37;
        stc_gpio_epfr37_field_t EPFR37_f;
        struct {
          union {
            __IO uint16_t EPFR37L;
            struct {
              __IO uint8_t EPFR37LL;
              __IO uint8_t EPFR37LH;
            };
          };
          union {
            __IO uint16_t EPFR37H;
            struct {
              __IO uint8_t EPFR37HL;
              __IO uint8_t EPFR37HH;
            };
          };
        };
    };
    union {
        __IO uint32_t EPFR38;
        stc_gpio_epfr38_field_t EPFR38_f;
        struct {
          union {
            __IO uint16_t EPFR38L;
            struct {
              __IO uint8_t EPFR38LL;
              __IO uint8_t EPFR38LH;
            };
          };
          union {
            __IO uint16_t EPFR38H;
            struct {
              __IO uint8_t EPFR38HL;
              __IO uint8_t EPFR38HH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED15[100];
    union {
        __IO uint32_t PZR0;
        stc_gpio_pzr0_field_t PZR0_f;
        struct {
          union {
            __IO uint16_t PZR0L;
            struct {
              __IO uint8_t PZR0LL;
              __IO uint8_t PZR0LH;
            };
          };
          union {
            __IO uint16_t PZR0H;
            struct {
              __IO uint8_t PZR0HL;
              __IO uint8_t PZR0HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZR1;
        stc_gpio_pzr1_field_t PZR1_f;
        struct {
          union {
            __IO uint16_t PZR1L;
            struct {
              __IO uint8_t PZR1LL;
              __IO uint8_t PZR1LH;
            };
          };
          union {
            __IO uint16_t PZR1H;
            struct {
              __IO uint8_t PZR1HL;
              __IO uint8_t PZR1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZR2;
        stc_gpio_pzr2_field_t PZR2_f;
        struct {
          union {
            __IO uint16_t PZR2L;
            struct {
              __IO uint8_t PZR2LL;
              __IO uint8_t PZR2LH;
            };
          };
          union {
            __IO uint16_t PZR2H;
            struct {
              __IO uint8_t PZR2HL;
              __IO uint8_t PZR2HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZR3;
        stc_gpio_pzr3_field_t PZR3_f;
        struct {
          union {
            __IO uint16_t PZR3L;
            struct {
              __IO uint8_t PZR3LL;
              __IO uint8_t PZR3LH;
            };
          };
          union {
            __IO uint16_t PZR3H;
            struct {
              __IO uint8_t PZR3HL;
              __IO uint8_t PZR3HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZR4;
        stc_gpio_pzr4_field_t PZR4_f;
        struct {
          union {
            __IO uint16_t PZR4L;
            struct {
              __IO uint8_t PZR4LL;
              __IO uint8_t PZR4LH;
            };
          };
          union {
            __IO uint16_t PZR4H;
            struct {
              __IO uint8_t PZR4HL;
              __IO uint8_t PZR4HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZR5;
        stc_gpio_pzr5_field_t PZR5_f;
        struct {
          union {
            __IO uint16_t PZR5L;
            struct {
              __IO uint8_t PZR5LL;
              __IO uint8_t PZR5LH;
            };
          };
          union {
            __IO uint16_t PZR5H;
            struct {
              __IO uint8_t PZR5HL;
              __IO uint8_t PZR5HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZR6;
        stc_gpio_pzr6_field_t PZR6_f;
        struct {
          union {
            __IO uint16_t PZR6L;
            struct {
              __IO uint8_t PZR6LL;
              __IO uint8_t PZR6LH;
            };
          };
          union {
            __IO uint16_t PZR6H;
            struct {
              __IO uint8_t PZR6HL;
              __IO uint8_t PZR6HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZR7;
        struct {
          union {
            __IO uint16_t PZR7L;
            struct {
              __IO uint8_t PZR7LL;
              __IO uint8_t PZR7LH;
            };
          };
          union {
            __IO uint16_t PZR7H;
            struct {
              __IO uint8_t PZR7HL;
              __IO uint8_t PZR7HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZR8;
        stc_gpio_pzr8_field_t PZR8_f;
        struct {
          union {
            __IO uint16_t PZR8L;
            struct {
              __IO uint8_t PZR8LL;
              __IO uint8_t PZR8LH;
            };
          };
          union {
            __IO uint16_t PZR8H;
            struct {
              __IO uint8_t PZR8HL;
              __IO uint8_t PZR8HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZR9;
        struct {
          union {
            __IO uint16_t PZR9L;
            struct {
              __IO uint8_t PZR9LL;
              __IO uint8_t PZR9LH;
            };
          };
          union {
            __IO uint16_t PZR9H;
            struct {
              __IO uint8_t PZR9HL;
              __IO uint8_t PZR9HH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZRA;
        struct {
          union {
            __IO uint16_t PZRAL;
            struct {
              __IO uint8_t PZRALL;
              __IO uint8_t PZRALH;
            };
          };
          union {
            __IO uint16_t PZRAH;
            struct {
              __IO uint8_t PZRAHL;
              __IO uint8_t PZRAHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZRB;
        struct {
          union {
            __IO uint16_t PZRBL;
            struct {
              __IO uint8_t PZRBLL;
              __IO uint8_t PZRBLH;
            };
          };
          union {
            __IO uint16_t PZRBH;
            struct {
              __IO uint8_t PZRBHL;
              __IO uint8_t PZRBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZRC;
        struct {
          union {
            __IO uint16_t PZRCL;
            struct {
              __IO uint8_t PZRCLL;
              __IO uint8_t PZRCLH;
            };
          };
          union {
            __IO uint16_t PZRCH;
            struct {
              __IO uint8_t PZRCHL;
              __IO uint8_t PZRCHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZRD;
        struct {
          union {
            __IO uint16_t PZRDL;
            struct {
              __IO uint8_t PZRDLL;
              __IO uint8_t PZRDLH;
            };
          };
          union {
            __IO uint16_t PZRDH;
            struct {
              __IO uint8_t PZRDHL;
              __IO uint8_t PZRDHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZRE;
        stc_gpio_pzre_field_t PZRE_f;
        struct {
          union {
            __IO uint16_t PZREL;
            struct {
              __IO uint8_t PZRELL;
              __IO uint8_t PZRELH;
            };
          };
          union {
            __IO uint16_t PZREH;
            struct {
              __IO uint8_t PZREHL;
              __IO uint8_t PZREHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PZRF;
        struct {
          union {
            __IO uint16_t PZRFL;
            struct {
              __IO uint8_t PZRFLL;
              __IO uint8_t PZRFLH;
            };
          };
          union {
            __IO uint16_t PZRFH;
            struct {
              __IO uint8_t PZRFHL;
              __IO uint8_t PZRFHH;
            };
          };
        };
    };
    union {
        __IO uint32_t LVDIE;
        stc_gpio_lvdie_field_t LVDIE_f;
        struct {
          union {
            __IO uint16_t LVDIEL;
            struct {
              __IO uint8_t LVDIELL;
              __IO uint8_t LVDIELH;
            };
          };
          union {
            __IO uint16_t LVDIEH;
            struct {
              __IO uint8_t LVDIEHL;
              __IO uint8_t LVDIEHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED16[444];
    union {
        __IO uint32_t FPOER0;
        stc_gpio_fpoer0_field_t FPOER0_f;
        struct {
          union {
            __IO uint16_t FPOER0L;
            struct {
              __IO uint8_t FPOER0LL;
              __IO uint8_t FPOER0LH;
            };
          };
          union {
            __IO uint16_t FPOER0H;
            struct {
              __IO uint8_t FPOER0HL;
              __IO uint8_t FPOER0HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOER1;
        stc_gpio_fpoer1_field_t FPOER1_f;
        struct {
          union {
            __IO uint16_t FPOER1L;
            struct {
              __IO uint8_t FPOER1LL;
              __IO uint8_t FPOER1LH;
            };
          };
          union {
            __IO uint16_t FPOER1H;
            struct {
              __IO uint8_t FPOER1HL;
              __IO uint8_t FPOER1HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOER2;
        stc_gpio_fpoer2_field_t FPOER2_f;
        struct {
          union {
            __IO uint16_t FPOER2L;
            struct {
              __IO uint8_t FPOER2LL;
              __IO uint8_t FPOER2LH;
            };
          };
          union {
            __IO uint16_t FPOER2H;
            struct {
              __IO uint8_t FPOER2HL;
              __IO uint8_t FPOER2HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOER3;
        stc_gpio_fpoer3_field_t FPOER3_f;
        struct {
          union {
            __IO uint16_t FPOER3L;
            struct {
              __IO uint8_t FPOER3LL;
              __IO uint8_t FPOER3LH;
            };
          };
          union {
            __IO uint16_t FPOER3H;
            struct {
              __IO uint8_t FPOER3HL;
              __IO uint8_t FPOER3HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOER4;
        stc_gpio_fpoer4_field_t FPOER4_f;
        struct {
          union {
            __IO uint16_t FPOER4L;
            struct {
              __IO uint8_t FPOER4LL;
              __IO uint8_t FPOER4LH;
            };
          };
          union {
            __IO uint16_t FPOER4H;
            struct {
              __IO uint8_t FPOER4HL;
              __IO uint8_t FPOER4HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOER5;
        stc_gpio_fpoer5_field_t FPOER5_f;
        struct {
          union {
            __IO uint16_t FPOER5L;
            struct {
              __IO uint8_t FPOER5LL;
              __IO uint8_t FPOER5LH;
            };
          };
          union {
            __IO uint16_t FPOER5H;
            struct {
              __IO uint8_t FPOER5HL;
              __IO uint8_t FPOER5HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOER6;
        stc_gpio_fpoer6_field_t FPOER6_f;
        struct {
          union {
            __IO uint16_t FPOER6L;
            struct {
              __IO uint8_t FPOER6LL;
              __IO uint8_t FPOER6LH;
            };
          };
          union {
            __IO uint16_t FPOER6H;
            struct {
              __IO uint8_t FPOER6HL;
              __IO uint8_t FPOER6HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOER7;
        struct {
          union {
            __IO uint16_t FPOER7L;
            struct {
              __IO uint8_t FPOER7LL;
              __IO uint8_t FPOER7LH;
            };
          };
          union {
            __IO uint16_t FPOER7H;
            struct {
              __IO uint8_t FPOER7HL;
              __IO uint8_t FPOER7HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOER8;
        stc_gpio_fpoer8_field_t FPOER8_f;
        struct {
          union {
            __IO uint16_t FPOER8L;
            struct {
              __IO uint8_t FPOER8LL;
              __IO uint8_t FPOER8LH;
            };
          };
          union {
            __IO uint16_t FPOER8H;
            struct {
              __IO uint8_t FPOER8HL;
              __IO uint8_t FPOER8HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOER9;
        struct {
          union {
            __IO uint16_t FPOER9L;
            struct {
              __IO uint8_t FPOER9LL;
              __IO uint8_t FPOER9LH;
            };
          };
          union {
            __IO uint16_t FPOER9H;
            struct {
              __IO uint8_t FPOER9HL;
              __IO uint8_t FPOER9HH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOERA;
        struct {
          union {
            __IO uint16_t FPOERAL;
            struct {
              __IO uint8_t FPOERALL;
              __IO uint8_t FPOERALH;
            };
          };
          union {
            __IO uint16_t FPOERAH;
            struct {
              __IO uint8_t FPOERAHL;
              __IO uint8_t FPOERAHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOERB;
        struct {
          union {
            __IO uint16_t FPOERBL;
            struct {
              __IO uint8_t FPOERBLL;
              __IO uint8_t FPOERBLH;
            };
          };
          union {
            __IO uint16_t FPOERBH;
            struct {
              __IO uint8_t FPOERBHL;
              __IO uint8_t FPOERBHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOERC;
        struct {
          union {
            __IO uint16_t FPOERCL;
            struct {
              __IO uint8_t FPOERCLL;
              __IO uint8_t FPOERCLH;
            };
          };
          union {
            __IO uint16_t FPOERCH;
            struct {
              __IO uint8_t FPOERCHL;
              __IO uint8_t FPOERCHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOERD;
        struct {
          union {
            __IO uint16_t FPOERDL;
            struct {
              __IO uint8_t FPOERDLL;
              __IO uint8_t FPOERDLH;
            };
          };
          union {
            __IO uint16_t FPOERDH;
            struct {
              __IO uint8_t FPOERDHL;
              __IO uint8_t FPOERDHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOERE;
        stc_gpio_fpoere_field_t FPOERE_f;
        struct {
          union {
            __IO uint16_t FPOEREL;
            struct {
              __IO uint8_t FPOERELL;
              __IO uint8_t FPOERELH;
            };
          };
          union {
            __IO uint16_t FPOEREH;
            struct {
              __IO uint8_t FPOEREHL;
              __IO uint8_t FPOEREHH;
            };
          };
        };
    };
    union {
        __IO uint32_t FPOERF;
        struct {
          union {
            __IO uint16_t FPOERFL;
            struct {
              __IO uint8_t FPOERFLL;
              __IO uint8_t FPOERFLH;
            };
          };
          union {
            __IO uint16_t FPOERFH;
            struct {
              __IO uint8_t FPOERFHL;
              __IO uint8_t FPOERFHH;
            };
          };
        };
    };
} FM_GPIO_TypeDef, FM0P_GPIO_TypeDef;

