mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1c3xb/common/s6e1c3xb.h
/*******************************************************************************
* CRTRIM Registers CRTRIM
*   Register Definition
*******************************************************************************/
#define FM_CRTRIM_MCR_PSR                         *((volatile  uint8_t*)(0x4002E000UL))
#define FM0P_CRTRIM_MCR_PSR                       *((volatile  uint8_t*)(0x4002E000UL))
#define FM_CRTRIM_MCR_FTRM                        *((volatile uint16_t*)(0x4002E004UL))
#define FM0P_CRTRIM_MCR_FTRM                      *((volatile uint16_t*)(0x4002E004UL))
#define FM_CRTRIM_MCR_TTRM                        *((volatile  uint8_t*)(0x4002E008UL))
#define FM0P_CRTRIM_MCR_TTRM                      *((volatile  uint8_t*)(0x4002E008UL))
#define FM_CRTRIM_MCR_RLR                         *((volatile uint32_t*)(0x4002E00CUL))
#define FM0P_CRTRIM_MCR_RLR                       *((volatile uint32_t*)(0x4002E00CUL))

/*******************************************************************************
* DS Registers DS
*   Register Definition
*******************************************************************************/
#define FM_DS_REG_CTL                             *((volatile  uint8_t*)(0x40035100UL))
#define FM0P_DS_REG_CTL                           *((volatile  uint8_t*)(0x40035100UL))
#define FM_DS_RCK_CTL                             *((volatile  uint8_t*)(0x40035104UL))
#define FM0P_DS_RCK_CTL                           *((volatile  uint8_t*)(0x40035104UL))
#define FM_DS_MOSC_CTL                            *((volatile  uint8_t*)(0x40035110UL))
#define FM0P_DS_MOSC_CTL                          *((volatile  uint8_t*)(0x40035110UL))
#define FM_DS_CAL_CTL                             *((volatile  uint8_t*)(0x40035200UL))
#define FM0P_DS_CAL_CTL                           *((volatile  uint8_t*)(0x40035200UL))
#define FM_DS_CAL_KEY                             *((volatile uint32_t*)(0x40035208UL))
#define FM0P_DS_CAL_KEY                           *((volatile uint32_t*)(0x40035208UL))
#define FM_DS_PMD_CTL                             *((volatile  uint8_t*)(0x40035800UL))
#define FM0P_DS_PMD_CTL                           *((volatile  uint8_t*)(0x40035800UL))
#define FM_DS_WRFSR                               *((volatile  uint8_t*)(0x40035804UL))
#define FM0P_DS_WRFSR                             *((volatile  uint8_t*)(0x40035804UL))
#define FM_DS_WIFSR                               *((volatile uint16_t*)(0x40035808UL))
#define FM0P_DS_WIFSR                             *((volatile uint16_t*)(0x40035808UL))
#define FM_DS_WIER                                *((volatile uint16_t*)(0x4003580CUL))
#define FM0P_DS_WIER                              *((volatile uint16_t*)(0x4003580CUL))
#define FM_DS_WILVR                               *((volatile uint16_t*)(0x40035810UL))
#define FM0P_DS_WILVR                             *((volatile uint16_t*)(0x40035810UL))
#define FM_DS_DSRAMR                              *((volatile  uint8_t*)(0x40035814UL))
#define FM0P_DS_DSRAMR                            *((volatile  uint8_t*)(0x40035814UL))
#define FM_DS_BUR01                               *((volatile  uint8_t*)(0x40035900UL))
#define FM0P_DS_BUR01                             *((volatile  uint8_t*)(0x40035900UL))
#define FM_DS_BUR02                               *((volatile  uint8_t*)(0x40035901UL))
#define FM0P_DS_BUR02                             *((volatile  uint8_t*)(0x40035901UL))
#define FM_DS_BUR03                               *((volatile  uint8_t*)(0x40035902UL))
#define FM0P_DS_BUR03                             *((volatile  uint8_t*)(0x40035902UL))
#define FM_DS_BUR04                               *((volatile  uint8_t*)(0x40035903UL))
#define FM0P_DS_BUR04                             *((volatile  uint8_t*)(0x40035903UL))
#define FM_DS_BUR05                               *((volatile  uint8_t*)(0x40035904UL))
#define FM0P_DS_BUR05                             *((volatile  uint8_t*)(0x40035904UL))
#define FM_DS_BUR06                               *((volatile  uint8_t*)(0x40035905UL))
#define FM0P_DS_BUR06                             *((volatile  uint8_t*)(0x40035905UL))
#define FM_DS_BUR07                               *((volatile  uint8_t*)(0x40035906UL))
#define FM0P_DS_BUR07                             *((volatile  uint8_t*)(0x40035906UL))
#define FM_DS_BUR08                               *((volatile  uint8_t*)(0x40035907UL))
#define FM0P_DS_BUR08                             *((volatile  uint8_t*)(0x40035907UL))
#define FM_DS_BUR09                               *((volatile  uint8_t*)(0x40035908UL))
#define FM0P_DS_BUR09                             *((volatile  uint8_t*)(0x40035908UL))
#define FM_DS_BUR10                               *((volatile  uint8_t*)(0x40035909UL))
#define FM0P_DS_BUR10                             *((volatile  uint8_t*)(0x40035909UL))
#define FM_DS_BUR11                               *((volatile  uint8_t*)(0x4003590AUL))
#define FM0P_DS_BUR11                             *((volatile  uint8_t*)(0x4003590AUL))
#define FM_DS_BUR12                               *((volatile  uint8_t*)(0x4003590BUL))
#define FM0P_DS_BUR12                             *((volatile  uint8_t*)(0x4003590BUL))
#define FM_DS_BUR13                               *((volatile  uint8_t*)(0x4003590CUL))
#define FM0P_DS_BUR13                             *((volatile  uint8_t*)(0x4003590CUL))
#define FM_DS_BUR14                               *((volatile  uint8_t*)(0x4003590DUL))
#define FM0P_DS_BUR14                             *((volatile  uint8_t*)(0x4003590DUL))
#define FM_DS_BUR15                               *((volatile  uint8_t*)(0x4003590EUL))
#define FM0P_DS_BUR15                             *((volatile  uint8_t*)(0x4003590EUL))
#define FM_DS_BUR16                               *((volatile  uint8_t*)(0x4003590FUL))
#define FM0P_DS_BUR16                             *((volatile  uint8_t*)(0x4003590FUL))
#define FM_DS_WIOLC_CTL                           *((volatile uint32_t*)(0x40035A00UL))
#define FM0P_DS_WIOLC_CTL                         *((volatile uint32_t*)(0x40035A00UL))
#define FM_DS_SUBOSC_CTL                          *((volatile  uint8_t*)(0x40035A04UL))
#define FM0P_DS_SUBOSC_CTL                        *((volatile  uint8_t*)(0x40035A04UL))
#define FM_DS_CEC_CTL                             *((volatile  uint8_t*)(0x40035A08UL))
#define FM0P_DS_CEC_CTL                           *((volatile  uint8_t*)(0x40035A08UL))
#define FM_DS_DEBUG_SW_CTL                        *((volatile  uint8_t*)(0x40035A0CUL))
#define FM0P_DS_DEBUG_SW_CTL                      *((volatile  uint8_t*)(0x40035A0CUL))

