mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1c3xb/common/s6e1c3xb.h
/*******************************************************************************
* USBCLK Registers USBCLK
*   Register Definition
*******************************************************************************/
#define FM_USBCLK_UCCR                            *((volatile  uint8_t*)(0x40036000UL))
#define FM0P_USBCLK_UCCR                          *((volatile  uint8_t*)(0x40036000UL))
#define FM_USBCLK_UPCR6                           *((volatile  uint8_t*)(0x40036028UL))
#define FM0P_USBCLK_UPCR6                         *((volatile  uint8_t*)(0x40036028UL))
#define FM_USBCLK_USBEN0                          *((volatile  uint8_t*)(0x40036030UL))
#define FM0P_USBCLK_USBEN0                        *((volatile  uint8_t*)(0x40036030UL))

/*******************************************************************************
* VIR Registers VIR
*   Register Definition
*******************************************************************************/
#define FM_VIR_VIR00                              *((volatile uint32_t*)(0xF8000100UL))
#define FM0P_VIR_VIR00                            *((volatile uint32_t*)(0xF8000100UL))
#define FM_VIR_VIR01                              *((volatile uint32_t*)(0xF8000104UL))
#define FM0P_VIR_VIR01                            *((volatile uint32_t*)(0xF8000104UL))
#define FM_VIR_VIR02                              *((volatile uint32_t*)(0xF8000108UL))
#define FM0P_VIR_VIR02                            *((volatile uint32_t*)(0xF8000108UL))
#define FM_VIR_VIR03                              *((volatile uint32_t*)(0xF800010CUL))
#define FM0P_VIR_VIR03                            *((volatile uint32_t*)(0xF800010CUL))
#define FM_VIR_VIR04                              *((volatile uint32_t*)(0xF8000110UL))
#define FM0P_VIR_VIR04                            *((volatile uint32_t*)(0xF8000110UL))
#define FM_VIR_VIR05                              *((volatile uint32_t*)(0xF8000114UL))
#define FM0P_VIR_VIR05                            *((volatile uint32_t*)(0xF8000114UL))
#define FM_VIR_VIR06                              *((volatile uint32_t*)(0xF8000118UL))
#define FM0P_VIR_VIR06                            *((volatile uint32_t*)(0xF8000118UL))
#define FM_VIR_VIR07                              *((volatile uint32_t*)(0xF800011CUL))
#define FM0P_VIR_VIR07                            *((volatile uint32_t*)(0xF800011CUL))
#define FM_VIR_VIR08                              *((volatile uint32_t*)(0xF8000120UL))
#define FM0P_VIR_VIR08                            *((volatile uint32_t*)(0xF8000120UL))
#define FM_VIR_VIR09                              *((volatile uint32_t*)(0xF8000124UL))
#define FM0P_VIR_VIR09                            *((volatile uint32_t*)(0xF8000124UL))
#define FM_VIR_VIR10                              *((volatile uint32_t*)(0xF8000128UL))
#define FM0P_VIR_VIR10                            *((volatile uint32_t*)(0xF8000128UL))
#define FM_VIR_VIR11                              *((volatile uint32_t*)(0xF800012CUL))
#define FM0P_VIR_VIR11                            *((volatile uint32_t*)(0xF800012CUL))
#define FM_VIR_VIR12                              *((volatile uint32_t*)(0xF8000130UL))
#define FM0P_VIR_VIR12                            *((volatile uint32_t*)(0xF8000130UL))
#define FM_VIR_VIR13                              *((volatile uint32_t*)(0xF8000134UL))
#define FM0P_VIR_VIR13                            *((volatile uint32_t*)(0xF8000134UL))
#define FM_VIR_VIR14                              *((volatile uint32_t*)(0xF8000138UL))
#define FM0P_VIR_VIR14                            *((volatile uint32_t*)(0xF8000138UL))
#define FM_VIR_VIR15                              *((volatile uint32_t*)(0xF800013CUL))
#define FM0P_VIR_VIR15                            *((volatile uint32_t*)(0xF800013CUL))
#define FM_VIR_VIR16                              *((volatile uint32_t*)(0xF8000140UL))
#define FM0P_VIR_VIR16                            *((volatile uint32_t*)(0xF8000140UL))
#define FM_VIR_VIR17                              *((volatile uint32_t*)(0xF8000144UL))
#define FM0P_VIR_VIR17                            *((volatile uint32_t*)(0xF8000144UL))
#define FM_VIR_VIR18                              *((volatile uint32_t*)(0xF8000148UL))
#define FM0P_VIR_VIR18                            *((volatile uint32_t*)(0xF8000148UL))
#define FM_VIR_VIR19                              *((volatile uint32_t*)(0xF800014CUL))
#define FM0P_VIR_VIR19                            *((volatile uint32_t*)(0xF800014CUL))
#define FM_VIR_VIR20                              *((volatile uint32_t*)(0xF8000150UL))
#define FM0P_VIR_VIR20                            *((volatile uint32_t*)(0xF8000150UL))
#define FM_VIR_VIR21                              *((volatile uint32_t*)(0xF8000154UL))
#define FM0P_VIR_VIR21                            *((volatile uint32_t*)(0xF8000154UL))
#define FM_VIR_VIR22                              *((volatile uint32_t*)(0xF8000158UL))
#define FM0P_VIR_VIR22                            *((volatile uint32_t*)(0xF8000158UL))
#define FM_VIR_VIR23                              *((volatile uint32_t*)(0xF800015CUL))
#define FM0P_VIR_VIR23                            *((volatile uint32_t*)(0xF800015CUL))
#define FM_VIR_VIR24                              *((volatile uint32_t*)(0xF8000160UL))
#define FM0P_VIR_VIR24                            *((volatile uint32_t*)(0xF8000160UL))
#define FM_VIR_VIR25                              *((volatile uint32_t*)(0xF8000164UL))
#define FM0P_VIR_VIR25                            *((volatile uint32_t*)(0xF8000164UL))
#define FM_VIR_VIR26                              *((volatile uint32_t*)(0xF8000168UL))
#define FM0P_VIR_VIR26                            *((volatile uint32_t*)(0xF8000168UL))
#define FM_VIR_VIR27                              *((volatile uint32_t*)(0xF800016CUL))
#define FM0P_VIR_VIR27                            *((volatile uint32_t*)(0xF800016CUL))
#define FM_VIR_VIR28                              *((volatile uint32_t*)(0xF8000170UL))
#define FM0P_VIR_VIR28                            *((volatile uint32_t*)(0xF8000170UL))
#define FM_VIR_VIR29                              *((volatile uint32_t*)(0xF8000174UL))
#define FM0P_VIR_VIR29                            *((volatile uint32_t*)(0xF8000174UL))
#define FM_VIR_VIR30                              *((volatile uint32_t*)(0xF8000178UL))
#define FM0P_VIR_VIR30                            *((volatile uint32_t*)(0xF8000178UL))
#define FM_VIR_VIR31                              *((volatile uint32_t*)(0xF800017CUL))
#define FM0P_VIR_VIR31                            *((volatile uint32_t*)(0xF800017CUL))

