mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1c3xb/common/s6e1c3xb.h
#define bFM_FASTIO_FPDOR5_P0                      *((volatile  uint8_t *)(0xF8015404UL))
#define bFM0P_FASTIO_FPDOR5_P0                    *((volatile  uint8_t *)(0xF8015404UL))
#define bFM_FASTIO_FPDOR5_P1                      *((volatile  uint8_t *)(0xF8015408UL))
#define bFM0P_FASTIO_FPDOR5_P1                    *((volatile  uint8_t *)(0xF8015408UL))
#define bFM_FASTIO_FPDOR5_P2                      *((volatile  uint8_t *)(0xF8015410UL))
#define bFM0P_FASTIO_FPDOR5_P2                    *((volatile  uint8_t *)(0xF8015410UL))

#define bFM_FASTIO_FPDOR6_P0                      *((volatile  uint8_t *)(0xF8015804UL))
#define bFM0P_FASTIO_FPDOR6_P0                    *((volatile  uint8_t *)(0xF8015804UL))

#define bFM_FASTIO_FPDOR8_P0                      *((volatile  uint8_t *)(0xF8016004UL))
#define bFM0P_FASTIO_FPDOR8_P0                    *((volatile  uint8_t *)(0xF8016004UL))
#define bFM_FASTIO_FPDOR8_P1                      *((volatile  uint8_t *)(0xF8016008UL))
#define bFM0P_FASTIO_FPDOR8_P1                    *((volatile  uint8_t *)(0xF8016008UL))

#define bFM_FASTIO_FPDORE_P2                      *((volatile  uint8_t *)(0xF8017810UL))
#define bFM0P_FASTIO_FPDORE_P2                    *((volatile  uint8_t *)(0xF8017810UL))
#define bFM_FASTIO_FPDORE_P3                      *((volatile  uint8_t *)(0xF8017820UL))
#define bFM0P_FASTIO_FPDORE_P3                    *((volatile  uint8_t *)(0xF8017820UL))

#define bFM_FASTIO_M_FPDIR0_P0                    *((volatile  uint8_t *)(0xF8018004UL))
#define bFM0P_FASTIO_M_FPDIR0_P0                  *((volatile  uint8_t *)(0xF8018004UL))
#define bFM_FASTIO_M_FPDIR0_P1                    *((volatile  uint8_t *)(0xF8018008UL))
#define bFM0P_FASTIO_M_FPDIR0_P1                  *((volatile  uint8_t *)(0xF8018008UL))
#define bFM_FASTIO_M_FPDIR0_P2                    *((volatile  uint8_t *)(0xF8018010UL))
#define bFM0P_FASTIO_M_FPDIR0_P2                  *((volatile  uint8_t *)(0xF8018010UL))
#define bFM_FASTIO_M_FPDIR0_P3                    *((volatile  uint8_t *)(0xF8018020UL))
#define bFM0P_FASTIO_M_FPDIR0_P3                  *((volatile  uint8_t *)(0xF8018020UL))
#define bFM_FASTIO_M_FPDIR0_P4                    *((volatile  uint8_t *)(0xF8018040UL))
#define bFM0P_FASTIO_M_FPDIR0_P4                  *((volatile  uint8_t *)(0xF8018040UL))
#define bFM_FASTIO_M_FPDIR0_P5                    *((volatile  uint8_t *)(0xF8018080UL))
#define bFM0P_FASTIO_M_FPDIR0_P5                  *((volatile  uint8_t *)(0xF8018080UL))
#define bFM_FASTIO_M_FPDIR0_P6                    *((volatile  uint8_t *)(0xF8018100UL))
#define bFM0P_FASTIO_M_FPDIR0_P6                  *((volatile  uint8_t *)(0xF8018100UL))
#define bFM_FASTIO_M_FPDIR0_P7                    *((volatile  uint8_t *)(0xF8018200UL))
#define bFM0P_FASTIO_M_FPDIR0_P7                  *((volatile  uint8_t *)(0xF8018200UL))

#define bFM_FASTIO_M_FPDIR1_P0                    *((volatile  uint8_t *)(0xF8018404UL))
#define bFM0P_FASTIO_M_FPDIR1_P0                  *((volatile  uint8_t *)(0xF8018404UL))
#define bFM_FASTIO_M_FPDIR1_P1                    *((volatile  uint8_t *)(0xF8018408UL))
#define bFM0P_FASTIO_M_FPDIR1_P1                  *((volatile  uint8_t *)(0xF8018408UL))
#define bFM_FASTIO_M_FPDIR1_P2                    *((volatile  uint8_t *)(0xF8018410UL))
#define bFM0P_FASTIO_M_FPDIR1_P2                  *((volatile  uint8_t *)(0xF8018410UL))
#define bFM_FASTIO_M_FPDIR1_P3                    *((volatile  uint8_t *)(0xF8018420UL))
#define bFM0P_FASTIO_M_FPDIR1_P3                  *((volatile  uint8_t *)(0xF8018420UL))
#define bFM_FASTIO_M_FPDIR1_P4                    *((volatile  uint8_t *)(0xF8018440UL))
#define bFM0P_FASTIO_M_FPDIR1_P4                  *((volatile  uint8_t *)(0xF8018440UL))
#define bFM_FASTIO_M_FPDIR1_P5                    *((volatile  uint8_t *)(0xF8018480UL))
#define bFM0P_FASTIO_M_FPDIR1_P5                  *((volatile  uint8_t *)(0xF8018480UL))
#define bFM_FASTIO_M_FPDIR1_P6                    *((volatile  uint8_t *)(0xF8018500UL))
#define bFM0P_FASTIO_M_FPDIR1_P6                  *((volatile  uint8_t *)(0xF8018500UL))
#define bFM_FASTIO_M_FPDIR1_P7                    *((volatile  uint8_t *)(0xF8018600UL))
#define bFM0P_FASTIO_M_FPDIR1_P7                  *((volatile  uint8_t *)(0xF8018600UL))

#define bFM_FASTIO_M_FPDOR0_P0                    *((volatile  uint8_t *)(0xF801C004UL))
#define bFM0P_FASTIO_M_FPDOR0_P0                  *((volatile  uint8_t *)(0xF801C004UL))
#define bFM_FASTIO_M_FPDOR0_P1                    *((volatile  uint8_t *)(0xF801C008UL))
#define bFM0P_FASTIO_M_FPDOR0_P1                  *((volatile  uint8_t *)(0xF801C008UL))
#define bFM_FASTIO_M_FPDOR0_P2                    *((volatile  uint8_t *)(0xF801C010UL))
#define bFM0P_FASTIO_M_FPDOR0_P2                  *((volatile  uint8_t *)(0xF801C010UL))
#define bFM_FASTIO_M_FPDOR0_P3                    *((volatile  uint8_t *)(0xF801C020UL))
#define bFM0P_FASTIO_M_FPDOR0_P3                  *((volatile  uint8_t *)(0xF801C020UL))
#define bFM_FASTIO_M_FPDOR0_P4                    *((volatile  uint8_t *)(0xF801C040UL))
#define bFM0P_FASTIO_M_FPDOR0_P4                  *((volatile  uint8_t *)(0xF801C040UL))
#define bFM_FASTIO_M_FPDOR0_P5                    *((volatile  uint8_t *)(0xF801C080UL))
#define bFM0P_FASTIO_M_FPDOR0_P5                  *((volatile  uint8_t *)(0xF801C080UL))
#define bFM_FASTIO_M_FPDOR0_P6                    *((volatile  uint8_t *)(0xF801C100UL))
#define bFM0P_FASTIO_M_FPDOR0_P6                  *((volatile  uint8_t *)(0xF801C100UL))
#define bFM_FASTIO_M_FPDOR0_P7                    *((volatile  uint8_t *)(0xF801C200UL))
#define bFM0P_FASTIO_M_FPDOR0_P7                  *((volatile  uint8_t *)(0xF801C200UL))

#define bFM_FASTIO_M_FPDOR1_P0                    *((volatile  uint8_t *)(0xF801C404UL))
#define bFM0P_FASTIO_M_FPDOR1_P0                  *((volatile  uint8_t *)(0xF801C404UL))
#define bFM_FASTIO_M_FPDOR1_P1                    *((volatile  uint8_t *)(0xF801C408UL))
#define bFM0P_FASTIO_M_FPDOR1_P1                  *((volatile  uint8_t *)(0xF801C408UL))
#define bFM_FASTIO_M_FPDOR1_P2                    *((volatile  uint8_t *)(0xF801C410UL))
#define bFM0P_FASTIO_M_FPDOR1_P2                  *((volatile  uint8_t *)(0xF801C410UL))
#define bFM_FASTIO_M_FPDOR1_P3                    *((volatile  uint8_t *)(0xF801C420UL))
#define bFM0P_FASTIO_M_FPDOR1_P3                  *((volatile  uint8_t *)(0xF801C420UL))
#define bFM_FASTIO_M_FPDOR1_P4                    *((volatile  uint8_t *)(0xF801C440UL))
#define bFM0P_FASTIO_M_FPDOR1_P4                  *((volatile  uint8_t *)(0xF801C440UL))
#define bFM_FASTIO_M_FPDOR1_P5                    *((volatile  uint8_t *)(0xF801C480UL))
#define bFM0P_FASTIO_M_FPDOR1_P5                  *((volatile  uint8_t *)(0xF801C480UL))
#define bFM_FASTIO_M_FPDOR1_P6                    *((volatile  uint8_t *)(0xF801C500UL))
#define bFM0P_FASTIO_M_FPDOR1_P6                  *((volatile  uint8_t *)(0xF801C500UL))
#define bFM_FASTIO_M_FPDOR1_P7                    *((volatile  uint8_t *)(0xF801C600UL))
#define bFM0P_FASTIO_M_FPDOR1_P7                  *((volatile  uint8_t *)(0xF801C600UL))


