mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1c3xb/common/s6e1c3xb.h
/*******************************************************************************
* FLASH_IF Registers FLASH_IF
*   Bitband Section
*******************************************************************************/
#define bFM_FLASH_IF_FICLR_RDYC                   *((volatile  uint8_t *)(0x42000500UL))
#define bFM0P_FLASH_IF_FICLR_RDYC                 *((volatile  uint8_t *)(0x42000500UL))
#define bFM_FLASH_IF_FICLR_HANGC                  *((volatile  uint8_t *)(0x42000504UL))
#define bFM0P_FLASH_IF_FICLR_HANGC                *((volatile  uint8_t *)(0x42000504UL))

#define bFM_FLASH_IF_FICR_RDYIE                   *((volatile  uint8_t *)(0x42000400UL))
#define bFM0P_FLASH_IF_FICR_RDYIE                 *((volatile  uint8_t *)(0x42000400UL))
#define bFM_FLASH_IF_FICR_HANGIE                  *((volatile  uint8_t *)(0x42000404UL))
#define bFM0P_FLASH_IF_FICR_HANGIE                *((volatile  uint8_t *)(0x42000404UL))

#define bFM_FLASH_IF_FISR_RDYIF                   *((volatile  uint8_t *)(0x42000480UL))
#define bFM0P_FLASH_IF_FISR_RDYIF                 *((volatile  uint8_t *)(0x42000480UL))
#define bFM_FLASH_IF_FISR_HANGIF                  *((volatile  uint8_t *)(0x42000484UL))
#define bFM0P_FLASH_IF_FISR_HANGIF                *((volatile  uint8_t *)(0x42000484UL))

#define bFM_FLASH_IF_FSTR_RDY                     *((volatile  uint8_t *)(0x42000100UL))
#define bFM0P_FLASH_IF_FSTR_RDY                   *((volatile  uint8_t *)(0x42000100UL))
#define bFM_FLASH_IF_FSTR_HNG                     *((volatile  uint8_t *)(0x42000104UL))
#define bFM0P_FLASH_IF_FSTR_HNG                   *((volatile  uint8_t *)(0x42000104UL))
#define bFM_FLASH_IF_FSTR_CERS                    *((volatile  uint8_t *)(0x42000108UL))
#define bFM0P_FLASH_IF_FSTR_CERS                  *((volatile  uint8_t *)(0x42000108UL))
#define bFM_FLASH_IF_FSTR_ESPS                    *((volatile  uint8_t *)(0x4200010CUL))
#define bFM0P_FLASH_IF_FSTR_ESPS                  *((volatile  uint8_t *)(0x4200010CUL))
#define bFM_FLASH_IF_FSTR_SERS                    *((volatile  uint8_t *)(0x42000110UL))
#define bFM0P_FLASH_IF_FSTR_SERS                  *((volatile  uint8_t *)(0x42000110UL))
#define bFM_FLASH_IF_FSTR_PGMS                    *((volatile  uint8_t *)(0x42000114UL))
#define bFM0P_FLASH_IF_FSTR_PGMS                  *((volatile  uint8_t *)(0x42000114UL))


/*******************************************************************************
* GPIO Registers GPIO
*   Bitband Section
*******************************************************************************/
#define bFM_GPIO_ADE_AN00                         *((volatile  uint8_t *)(0x4266A000UL))
#define bFM0P_GPIO_ADE_AN00                       *((volatile  uint8_t *)(0x4266A000UL))
#define bFM_GPIO_ADE_AN01                         *((volatile  uint8_t *)(0x4266A004UL))
#define bFM0P_GPIO_ADE_AN01                       *((volatile  uint8_t *)(0x4266A004UL))
#define bFM_GPIO_ADE_AN02                         *((volatile  uint8_t *)(0x4266A008UL))
#define bFM0P_GPIO_ADE_AN02                       *((volatile  uint8_t *)(0x4266A008UL))
#define bFM_GPIO_ADE_AN03                         *((volatile  uint8_t *)(0x4266A00CUL))
#define bFM0P_GPIO_ADE_AN03                       *((volatile  uint8_t *)(0x4266A00CUL))
#define bFM_GPIO_ADE_AN04                         *((volatile  uint8_t *)(0x4266A010UL))
#define bFM0P_GPIO_ADE_AN04                       *((volatile  uint8_t *)(0x4266A010UL))
#define bFM_GPIO_ADE_AN05                         *((volatile  uint8_t *)(0x4266A014UL))
#define bFM0P_GPIO_ADE_AN05                       *((volatile  uint8_t *)(0x4266A014UL))
#define bFM_GPIO_ADE_AN06                         *((volatile  uint8_t *)(0x4266A018UL))
#define bFM0P_GPIO_ADE_AN06                       *((volatile  uint8_t *)(0x4266A018UL))
#define bFM_GPIO_ADE_AN07                         *((volatile  uint8_t *)(0x4266A01CUL))
#define bFM0P_GPIO_ADE_AN07                       *((volatile  uint8_t *)(0x4266A01CUL))

#define bFM_GPIO_DDR0_P1                          *((volatile  uint8_t *)(0x42664004UL))
#define bFM0P_GPIO_DDR0_P1                        *((volatile  uint8_t *)(0x42664004UL))
#define bFM_GPIO_DDR0_P3                          *((volatile  uint8_t *)(0x4266400CUL))
#define bFM0P_GPIO_DDR0_P3                        *((volatile  uint8_t *)(0x4266400CUL))
#define bFM_GPIO_DDR0_P5                          *((volatile  uint8_t *)(0x42664014UL))
#define bFM0P_GPIO_DDR0_P5                        *((volatile  uint8_t *)(0x42664014UL))
#define bFM_GPIO_DDR0_PF                          *((volatile  uint8_t *)(0x4266403CUL))
#define bFM0P_GPIO_DDR0_PF                        *((volatile  uint8_t *)(0x4266403CUL))

#define bFM_GPIO_DDR1_P0                          *((volatile  uint8_t *)(0x42664080UL))
#define bFM0P_GPIO_DDR1_P0                        *((volatile  uint8_t *)(0x42664080UL))
#define bFM_GPIO_DDR1_P1                          *((volatile  uint8_t *)(0x42664084UL))
#define bFM0P_GPIO_DDR1_P1                        *((volatile  uint8_t *)(0x42664084UL))
#define bFM_GPIO_DDR1_P2                          *((volatile  uint8_t *)(0x42664088UL))
#define bFM0P_GPIO_DDR1_P2                        *((volatile  uint8_t *)(0x42664088UL))
#define bFM_GPIO_DDR1_P3                          *((volatile  uint8_t *)(0x4266408CUL))
#define bFM0P_GPIO_DDR1_P3                        *((volatile  uint8_t *)(0x4266408CUL))

#define bFM_GPIO_DDR2_P1                          *((volatile  uint8_t *)(0x42664104UL))
#define bFM0P_GPIO_DDR2_P1                        *((volatile  uint8_t *)(0x42664104UL))
#define bFM_GPIO_DDR2_P2                          *((volatile  uint8_t *)(0x42664108UL))
#define bFM0P_GPIO_DDR2_P2                        *((volatile  uint8_t *)(0x42664108UL))
#define bFM_GPIO_DDR2_P3                          *((volatile  uint8_t *)(0x4266410CUL))
#define bFM0P_GPIO_DDR2_P3                        *((volatile  uint8_t *)(0x4266410CUL))

