mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1c3xb/common/s6e1c3xb.h
#define bFM_I2CSLAVE_IBSSR_BB                     *((volatile  uint8_t *)(0x426F3000UL))
#define bFM0P_I2CSLAVE_IBSSR_BB                   *((volatile  uint8_t *)(0x426F3000UL))
#define bFM_I2CSLAVE_IBSSR_SPC                    *((volatile  uint8_t *)(0x426F3004UL))
#define bFM0P_I2CSLAVE_IBSSR_SPC                  *((volatile  uint8_t *)(0x426F3004UL))
#define bFM_I2CSLAVE_IBSSR_RSC                    *((volatile  uint8_t *)(0x426F3008UL))
#define bFM0P_I2CSLAVE_IBSSR_RSC                  *((volatile  uint8_t *)(0x426F3008UL))
#define bFM_I2CSLAVE_IBSSR_ACT                    *((volatile  uint8_t *)(0x426F300CUL))
#define bFM0P_I2CSLAVE_IBSSR_ACT                  *((volatile  uint8_t *)(0x426F300CUL))
#define bFM_I2CSLAVE_IBSSR_TRX                    *((volatile  uint8_t *)(0x426F3010UL))
#define bFM0P_I2CSLAVE_IBSSR_TRX                  *((volatile  uint8_t *)(0x426F3010UL))
#define bFM_I2CSLAVE_IBSSR_RSA                    *((volatile  uint8_t *)(0x426F3014UL))
#define bFM0P_I2CSLAVE_IBSSR_RSA                  *((volatile  uint8_t *)(0x426F3014UL))
#define bFM_I2CSLAVE_IBSSR_RACK                   *((volatile  uint8_t *)(0x426F3018UL))
#define bFM0P_I2CSLAVE_IBSSR_RACK                 *((volatile  uint8_t *)(0x426F3018UL))
#define bFM_I2CSLAVE_IBSSR_FBT                    *((volatile  uint8_t *)(0x426F301CUL))
#define bFM0P_I2CSLAVE_IBSSR_FBT                  *((volatile  uint8_t *)(0x426F301CUL))
#define bFM_I2CSLAVE_IBSSR_TDRE                   *((volatile  uint8_t *)(0x426F3020UL))
#define bFM0P_I2CSLAVE_IBSSR_TDRE                 *((volatile  uint8_t *)(0x426F3020UL))
#define bFM_I2CSLAVE_IBSSR_RDRF                   *((volatile  uint8_t *)(0x426F3024UL))
#define bFM0P_I2CSLAVE_IBSSR_RDRF                 *((volatile  uint8_t *)(0x426F3024UL))
#define bFM_I2CSLAVE_IBSSR_INT                    *((volatile  uint8_t *)(0x426F3028UL))
#define bFM0P_I2CSLAVE_IBSSR_INT                  *((volatile  uint8_t *)(0x426F3028UL))

#define bFM_I2CSLAVE_IBSSSR_TDRES                 *((volatile  uint8_t *)(0x426F32A0UL))
#define bFM0P_I2CSLAVE_IBSSSR_TDRES               *((volatile  uint8_t *)(0x426F32A0UL))


/*******************************************************************************
* INTREQ Registers INTREQ
*   Bitband Section
*******************************************************************************/
#define bFM_INTREQ_EXC02MON_NMI                   *((volatile  uint8_t *)(0x42624000UL))
#define bFM0P_INTREQ_EXC02MON_NMI                 *((volatile  uint8_t *)(0x42624000UL))
#define bFM_INTREQ_EXC02MON_HWINT                 *((volatile  uint8_t *)(0x42624004UL))
#define bFM0P_INTREQ_EXC02MON_HWINT               *((volatile  uint8_t *)(0x42624004UL))

#define bFM_INTREQ_IRQ00MON_INT0                  *((volatile  uint8_t *)(0x42624080UL))
#define bFM0P_INTREQ_IRQ00MON_INT0                *((volatile  uint8_t *)(0x42624080UL))
#define bFM_INTREQ_IRQ00MON_INT1                  *((volatile  uint8_t *)(0x42624084UL))
#define bFM0P_INTREQ_IRQ00MON_INT1                *((volatile  uint8_t *)(0x42624084UL))
#define bFM_INTREQ_IRQ00MON_INT2                  *((volatile  uint8_t *)(0x42624088UL))
#define bFM0P_INTREQ_IRQ00MON_INT2                *((volatile  uint8_t *)(0x42624088UL))

#define bFM_INTREQ_IRQ01MON_INT0                  *((volatile  uint8_t *)(0x42624100UL))
#define bFM0P_INTREQ_IRQ01MON_INT0                *((volatile  uint8_t *)(0x42624100UL))
#define bFM_INTREQ_IRQ01MON_INT1                  *((volatile  uint8_t *)(0x42624104UL))
#define bFM0P_INTREQ_IRQ01MON_INT1                *((volatile  uint8_t *)(0x42624104UL))
#define bFM_INTREQ_IRQ01MON_INT2                  *((volatile  uint8_t *)(0x42624108UL))
#define bFM0P_INTREQ_IRQ01MON_INT2                *((volatile  uint8_t *)(0x42624108UL))

#define bFM_INTREQ_IRQ02MON_INT0                  *((volatile  uint8_t *)(0x42624180UL))
#define bFM0P_INTREQ_IRQ02MON_INT0                *((volatile  uint8_t *)(0x42624180UL))
#define bFM_INTREQ_IRQ02MON_INT1                  *((volatile  uint8_t *)(0x42624184UL))
#define bFM0P_INTREQ_IRQ02MON_INT1                *((volatile  uint8_t *)(0x42624184UL))
#define bFM_INTREQ_IRQ02MON_INT2                  *((volatile  uint8_t *)(0x42624188UL))
#define bFM0P_INTREQ_IRQ02MON_INT2                *((volatile  uint8_t *)(0x42624188UL))

#define bFM_INTREQ_IRQ03MON_INT0                  *((volatile  uint8_t *)(0x42624200UL))
#define bFM0P_INTREQ_IRQ03MON_INT0                *((volatile  uint8_t *)(0x42624200UL))
#define bFM_INTREQ_IRQ03MON_INT1                  *((volatile  uint8_t *)(0x42624204UL))
#define bFM0P_INTREQ_IRQ03MON_INT1                *((volatile  uint8_t *)(0x42624204UL))
#define bFM_INTREQ_IRQ03MON_INT2                  *((volatile  uint8_t *)(0x42624208UL))
#define bFM0P_INTREQ_IRQ03MON_INT2                *((volatile  uint8_t *)(0x42624208UL))

#define bFM_INTREQ_IRQ04MON_INT0                  *((volatile  uint8_t *)(0x42624280UL))
#define bFM0P_INTREQ_IRQ04MON_INT0                *((volatile  uint8_t *)(0x42624280UL))
#define bFM_INTREQ_IRQ04MON_INT1                  *((volatile  uint8_t *)(0x42624284UL))
#define bFM0P_INTREQ_IRQ04MON_INT1                *((volatile  uint8_t *)(0x42624284UL))
#define bFM_INTREQ_IRQ04MON_INT2                  *((volatile  uint8_t *)(0x42624288UL))
#define bFM0P_INTREQ_IRQ04MON_INT2                *((volatile  uint8_t *)(0x42624288UL))

#define bFM_INTREQ_IRQ05MON_INT0                  *((volatile  uint8_t *)(0x42624300UL))
#define bFM0P_INTREQ_IRQ05MON_INT0                *((volatile  uint8_t *)(0x42624300UL))
#define bFM_INTREQ_IRQ05MON_INT1                  *((volatile  uint8_t *)(0x42624304UL))
#define bFM0P_INTREQ_IRQ05MON_INT1                *((volatile  uint8_t *)(0x42624304UL))
#define bFM_INTREQ_IRQ05MON_INT2                  *((volatile  uint8_t *)(0x42624308UL))
#define bFM0P_INTREQ_IRQ05MON_INT2                *((volatile  uint8_t *)(0x42624308UL))

#define bFM_INTREQ_IRQ06MON_INT0                  *((volatile  uint8_t *)(0x42624380UL))
#define bFM0P_INTREQ_IRQ06MON_INT0                *((volatile  uint8_t *)(0x42624380UL))
#define bFM_INTREQ_IRQ06MON_INT1                  *((volatile  uint8_t *)(0x42624384UL))
#define bFM0P_INTREQ_IRQ06MON_INT1                *((volatile  uint8_t *)(0x42624384UL))
#define bFM_INTREQ_IRQ06MON_INT2                  *((volatile  uint8_t *)(0x42624388UL))
#define bFM0P_INTREQ_IRQ06MON_INT2                *((volatile  uint8_t *)(0x42624388UL))

