mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1c3xb/common/s6e1c3xb.h
#define bFM_INTREQ_IRQ07MON_INT0                  *((volatile  uint8_t *)(0x42624400UL))
#define bFM0P_INTREQ_IRQ07MON_INT0                *((volatile  uint8_t *)(0x42624400UL))
#define bFM_INTREQ_IRQ07MON_INT1                  *((volatile  uint8_t *)(0x42624404UL))
#define bFM0P_INTREQ_IRQ07MON_INT1                *((volatile  uint8_t *)(0x42624404UL))
#define bFM_INTREQ_IRQ07MON_INT2                  *((volatile  uint8_t *)(0x42624408UL))
#define bFM0P_INTREQ_IRQ07MON_INT2                *((volatile  uint8_t *)(0x42624408UL))

#define bFM_INTREQ_IRQ08MON_INT0                  *((volatile  uint8_t *)(0x42624480UL))
#define bFM0P_INTREQ_IRQ08MON_INT0                *((volatile  uint8_t *)(0x42624480UL))
#define bFM_INTREQ_IRQ08MON_INT1                  *((volatile  uint8_t *)(0x42624484UL))
#define bFM0P_INTREQ_IRQ08MON_INT1                *((volatile  uint8_t *)(0x42624484UL))
#define bFM_INTREQ_IRQ08MON_INT2                  *((volatile  uint8_t *)(0x42624488UL))
#define bFM0P_INTREQ_IRQ08MON_INT2                *((volatile  uint8_t *)(0x42624488UL))

#define bFM_INTREQ_IRQ09MON_INT0                  *((volatile  uint8_t *)(0x42624500UL))
#define bFM0P_INTREQ_IRQ09MON_INT0                *((volatile  uint8_t *)(0x42624500UL))
#define bFM_INTREQ_IRQ09MON_INT1                  *((volatile  uint8_t *)(0x42624504UL))
#define bFM0P_INTREQ_IRQ09MON_INT1                *((volatile  uint8_t *)(0x42624504UL))
#define bFM_INTREQ_IRQ09MON_INT2                  *((volatile  uint8_t *)(0x42624508UL))
#define bFM0P_INTREQ_IRQ09MON_INT2                *((volatile  uint8_t *)(0x42624508UL))

#define bFM_INTREQ_IRQ10MON_INT0                  *((volatile  uint8_t *)(0x42624580UL))
#define bFM0P_INTREQ_IRQ10MON_INT0                *((volatile  uint8_t *)(0x42624580UL))
#define bFM_INTREQ_IRQ10MON_INT1                  *((volatile  uint8_t *)(0x42624584UL))
#define bFM0P_INTREQ_IRQ10MON_INT1                *((volatile  uint8_t *)(0x42624584UL))
#define bFM_INTREQ_IRQ10MON_INT2                  *((volatile  uint8_t *)(0x42624588UL))
#define bFM0P_INTREQ_IRQ10MON_INT2                *((volatile  uint8_t *)(0x42624588UL))

#define bFM_INTREQ_IRQ11MON_INT0                  *((volatile  uint8_t *)(0x42624600UL))
#define bFM0P_INTREQ_IRQ11MON_INT0                *((volatile  uint8_t *)(0x42624600UL))
#define bFM_INTREQ_IRQ11MON_INT1                  *((volatile  uint8_t *)(0x42624604UL))
#define bFM0P_INTREQ_IRQ11MON_INT1                *((volatile  uint8_t *)(0x42624604UL))
#define bFM_INTREQ_IRQ11MON_INT2                  *((volatile  uint8_t *)(0x42624608UL))
#define bFM0P_INTREQ_IRQ11MON_INT2                *((volatile  uint8_t *)(0x42624608UL))

#define bFM_INTREQ_IRQ12MON_INT0                  *((volatile  uint8_t *)(0x42624680UL))
#define bFM0P_INTREQ_IRQ12MON_INT0                *((volatile  uint8_t *)(0x42624680UL))
#define bFM_INTREQ_IRQ12MON_INT1                  *((volatile  uint8_t *)(0x42624684UL))
#define bFM0P_INTREQ_IRQ12MON_INT1                *((volatile  uint8_t *)(0x42624684UL))
#define bFM_INTREQ_IRQ12MON_INT2                  *((volatile  uint8_t *)(0x42624688UL))
#define bFM0P_INTREQ_IRQ12MON_INT2                *((volatile  uint8_t *)(0x42624688UL))

#define bFM_INTREQ_IRQ13MON_INT0                  *((volatile  uint8_t *)(0x42624700UL))
#define bFM0P_INTREQ_IRQ13MON_INT0                *((volatile  uint8_t *)(0x42624700UL))
#define bFM_INTREQ_IRQ13MON_INT1                  *((volatile  uint8_t *)(0x42624704UL))
#define bFM0P_INTREQ_IRQ13MON_INT1                *((volatile  uint8_t *)(0x42624704UL))
#define bFM_INTREQ_IRQ13MON_INT2                  *((volatile  uint8_t *)(0x42624708UL))
#define bFM0P_INTREQ_IRQ13MON_INT2                *((volatile  uint8_t *)(0x42624708UL))

#define bFM_INTREQ_IRQ14MON_INT0                  *((volatile  uint8_t *)(0x42624780UL))
#define bFM0P_INTREQ_IRQ14MON_INT0                *((volatile  uint8_t *)(0x42624780UL))
#define bFM_INTREQ_IRQ14MON_INT1                  *((volatile  uint8_t *)(0x42624784UL))
#define bFM0P_INTREQ_IRQ14MON_INT1                *((volatile  uint8_t *)(0x42624784UL))
#define bFM_INTREQ_IRQ14MON_INT2                  *((volatile  uint8_t *)(0x42624788UL))
#define bFM0P_INTREQ_IRQ14MON_INT2                *((volatile  uint8_t *)(0x42624788UL))

#define bFM_INTREQ_IRQ15MON_INT0                  *((volatile  uint8_t *)(0x42624800UL))
#define bFM0P_INTREQ_IRQ15MON_INT0                *((volatile  uint8_t *)(0x42624800UL))
#define bFM_INTREQ_IRQ15MON_INT1                  *((volatile  uint8_t *)(0x42624804UL))
#define bFM0P_INTREQ_IRQ15MON_INT1                *((volatile  uint8_t *)(0x42624804UL))
#define bFM_INTREQ_IRQ15MON_INT2                  *((volatile  uint8_t *)(0x42624808UL))
#define bFM0P_INTREQ_IRQ15MON_INT2                *((volatile  uint8_t *)(0x42624808UL))

#define bFM_INTREQ_IRQ16MON_INT0                  *((volatile  uint8_t *)(0x42624880UL))
#define bFM0P_INTREQ_IRQ16MON_INT0                *((volatile  uint8_t *)(0x42624880UL))
#define bFM_INTREQ_IRQ16MON_INT1                  *((volatile  uint8_t *)(0x42624884UL))
#define bFM0P_INTREQ_IRQ16MON_INT1                *((volatile  uint8_t *)(0x42624884UL))
#define bFM_INTREQ_IRQ16MON_INT2                  *((volatile  uint8_t *)(0x42624888UL))
#define bFM0P_INTREQ_IRQ16MON_INT2                *((volatile  uint8_t *)(0x42624888UL))

#define bFM_INTREQ_IRQ17MON_INT0                  *((volatile  uint8_t *)(0x42624900UL))
#define bFM0P_INTREQ_IRQ17MON_INT0                *((volatile  uint8_t *)(0x42624900UL))
#define bFM_INTREQ_IRQ17MON_INT1                  *((volatile  uint8_t *)(0x42624904UL))
#define bFM0P_INTREQ_IRQ17MON_INT1                *((volatile  uint8_t *)(0x42624904UL))
#define bFM_INTREQ_IRQ17MON_INT2                  *((volatile  uint8_t *)(0x42624908UL))
#define bFM0P_INTREQ_IRQ17MON_INT2                *((volatile  uint8_t *)(0x42624908UL))

#define bFM_INTREQ_IRQ18MON_INT0                  *((volatile  uint8_t *)(0x42624980UL))
#define bFM0P_INTREQ_IRQ18MON_INT0                *((volatile  uint8_t *)(0x42624980UL))
#define bFM_INTREQ_IRQ18MON_INT1                  *((volatile  uint8_t *)(0x42624984UL))
#define bFM0P_INTREQ_IRQ18MON_INT1                *((volatile  uint8_t *)(0x42624984UL))
#define bFM_INTREQ_IRQ18MON_INT2                  *((volatile  uint8_t *)(0x42624988UL))
#define bFM0P_INTREQ_IRQ18MON_INT2                *((volatile  uint8_t *)(0x42624988UL))

#define bFM_INTREQ_IRQ19MON_INT0                  *((volatile  uint8_t *)(0x42624A00UL))
#define bFM0P_INTREQ_IRQ19MON_INT0                *((volatile  uint8_t *)(0x42624A00UL))
#define bFM_INTREQ_IRQ19MON_INT1                  *((volatile  uint8_t *)(0x42624A04UL))
#define bFM0P_INTREQ_IRQ19MON_INT1                *((volatile  uint8_t *)(0x42624A04UL))
#define bFM_INTREQ_IRQ19MON_INT2                  *((volatile  uint8_t *)(0x42624A08UL))
#define bFM0P_INTREQ_IRQ19MON_INT2                *((volatile  uint8_t *)(0x42624A08UL))

#define bFM_INTREQ_IRQ20MON_INT0                  *((volatile  uint8_t *)(0x42624A80UL))
#define bFM0P_INTREQ_IRQ20MON_INT0                *((volatile  uint8_t *)(0x42624A80UL))
#define bFM_INTREQ_IRQ20MON_INT1                  *((volatile  uint8_t *)(0x42624A84UL))
#define bFM0P_INTREQ_IRQ20MON_INT1                *((volatile  uint8_t *)(0x42624A84UL))
#define bFM_INTREQ_IRQ20MON_INT2                  *((volatile  uint8_t *)(0x42624A88UL))
#define bFM0P_INTREQ_IRQ20MON_INT2                *((volatile  uint8_t *)(0x42624A88UL))

#define bFM_INTREQ_IRQ21MON_INT0                  *((volatile  uint8_t *)(0x42624B00UL))
#define bFM0P_INTREQ_IRQ21MON_INT0                *((volatile  uint8_t *)(0x42624B00UL))
#define bFM_INTREQ_IRQ21MON_INT1                  *((volatile  uint8_t *)(0x42624B04UL))
#define bFM0P_INTREQ_IRQ21MON_INT1                *((volatile  uint8_t *)(0x42624B04UL))
#define bFM_INTREQ_IRQ21MON_INT2                  *((volatile  uint8_t *)(0x42624B08UL))
#define bFM0P_INTREQ_IRQ21MON_INT2                *((volatile  uint8_t *)(0x42624B08UL))

#define bFM_INTREQ_IRQ22MON_INT0                  *((volatile  uint8_t *)(0x42624B80UL))
#define bFM0P_INTREQ_IRQ22MON_INT0                *((volatile  uint8_t *)(0x42624B80UL))
#define bFM_INTREQ_IRQ22MON_INT1                  *((volatile  uint8_t *)(0x42624B84UL))
#define bFM0P_INTREQ_IRQ22MON_INT1                *((volatile  uint8_t *)(0x42624B84UL))
#define bFM_INTREQ_IRQ22MON_INT2                  *((volatile  uint8_t *)(0x42624B88UL))
#define bFM0P_INTREQ_IRQ22MON_INT2                *((volatile  uint8_t *)(0x42624B88UL))

