mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1c3xb/common/s6e1c3xb.h
#define bFM_INTREQ_IRQ23MON_INT0                  *((volatile  uint8_t *)(0x42624C00UL))
#define bFM0P_INTREQ_IRQ23MON_INT0                *((volatile  uint8_t *)(0x42624C00UL))
#define bFM_INTREQ_IRQ23MON_INT1                  *((volatile  uint8_t *)(0x42624C04UL))
#define bFM0P_INTREQ_IRQ23MON_INT1                *((volatile  uint8_t *)(0x42624C04UL))
#define bFM_INTREQ_IRQ23MON_INT2                  *((volatile  uint8_t *)(0x42624C08UL))
#define bFM0P_INTREQ_IRQ23MON_INT2                *((volatile  uint8_t *)(0x42624C08UL))

#define bFM_INTREQ_IRQ24MON_INT0                  *((volatile  uint8_t *)(0x42624C80UL))
#define bFM0P_INTREQ_IRQ24MON_INT0                *((volatile  uint8_t *)(0x42624C80UL))
#define bFM_INTREQ_IRQ24MON_INT1                  *((volatile  uint8_t *)(0x42624C84UL))
#define bFM0P_INTREQ_IRQ24MON_INT1                *((volatile  uint8_t *)(0x42624C84UL))
#define bFM_INTREQ_IRQ24MON_INT2                  *((volatile  uint8_t *)(0x42624C88UL))
#define bFM0P_INTREQ_IRQ24MON_INT2                *((volatile  uint8_t *)(0x42624C88UL))

#define bFM_INTREQ_IRQ25MON_INT0                  *((volatile  uint8_t *)(0x42624D00UL))
#define bFM0P_INTREQ_IRQ25MON_INT0                *((volatile  uint8_t *)(0x42624D00UL))
#define bFM_INTREQ_IRQ25MON_INT1                  *((volatile  uint8_t *)(0x42624D04UL))
#define bFM0P_INTREQ_IRQ25MON_INT1                *((volatile  uint8_t *)(0x42624D04UL))
#define bFM_INTREQ_IRQ25MON_INT2                  *((volatile  uint8_t *)(0x42624D08UL))
#define bFM0P_INTREQ_IRQ25MON_INT2                *((volatile  uint8_t *)(0x42624D08UL))

#define bFM_INTREQ_IRQ26MON_INT0                  *((volatile  uint8_t *)(0x42624D80UL))
#define bFM0P_INTREQ_IRQ26MON_INT0                *((volatile  uint8_t *)(0x42624D80UL))
#define bFM_INTREQ_IRQ26MON_INT1                  *((volatile  uint8_t *)(0x42624D84UL))
#define bFM0P_INTREQ_IRQ26MON_INT1                *((volatile  uint8_t *)(0x42624D84UL))
#define bFM_INTREQ_IRQ26MON_INT2                  *((volatile  uint8_t *)(0x42624D88UL))
#define bFM0P_INTREQ_IRQ26MON_INT2                *((volatile  uint8_t *)(0x42624D88UL))

#define bFM_INTREQ_IRQ27MON_INT0                  *((volatile  uint8_t *)(0x42624E00UL))
#define bFM0P_INTREQ_IRQ27MON_INT0                *((volatile  uint8_t *)(0x42624E00UL))
#define bFM_INTREQ_IRQ27MON_INT1                  *((volatile  uint8_t *)(0x42624E04UL))
#define bFM0P_INTREQ_IRQ27MON_INT1                *((volatile  uint8_t *)(0x42624E04UL))
#define bFM_INTREQ_IRQ27MON_INT2                  *((volatile  uint8_t *)(0x42624E08UL))
#define bFM0P_INTREQ_IRQ27MON_INT2                *((volatile  uint8_t *)(0x42624E08UL))

#define bFM_INTREQ_IRQ28MON_INT0                  *((volatile  uint8_t *)(0x42624E80UL))
#define bFM0P_INTREQ_IRQ28MON_INT0                *((volatile  uint8_t *)(0x42624E80UL))
#define bFM_INTREQ_IRQ28MON_INT1                  *((volatile  uint8_t *)(0x42624E84UL))
#define bFM0P_INTREQ_IRQ28MON_INT1                *((volatile  uint8_t *)(0x42624E84UL))
#define bFM_INTREQ_IRQ28MON_INT2                  *((volatile  uint8_t *)(0x42624E88UL))
#define bFM0P_INTREQ_IRQ28MON_INT2                *((volatile  uint8_t *)(0x42624E88UL))

#define bFM_INTREQ_IRQ29MON_INT0                  *((volatile  uint8_t *)(0x42624F00UL))
#define bFM0P_INTREQ_IRQ29MON_INT0                *((volatile  uint8_t *)(0x42624F00UL))
#define bFM_INTREQ_IRQ29MON_INT1                  *((volatile  uint8_t *)(0x42624F04UL))
#define bFM0P_INTREQ_IRQ29MON_INT1                *((volatile  uint8_t *)(0x42624F04UL))
#define bFM_INTREQ_IRQ29MON_INT2                  *((volatile  uint8_t *)(0x42624F08UL))
#define bFM0P_INTREQ_IRQ29MON_INT2                *((volatile  uint8_t *)(0x42624F08UL))

#define bFM_INTREQ_IRQ30MON_INT0                  *((volatile  uint8_t *)(0x42624F80UL))
#define bFM0P_INTREQ_IRQ30MON_INT0                *((volatile  uint8_t *)(0x42624F80UL))
#define bFM_INTREQ_IRQ30MON_INT1                  *((volatile  uint8_t *)(0x42624F84UL))
#define bFM0P_INTREQ_IRQ30MON_INT1                *((volatile  uint8_t *)(0x42624F84UL))
#define bFM_INTREQ_IRQ30MON_INT2                  *((volatile  uint8_t *)(0x42624F88UL))
#define bFM0P_INTREQ_IRQ30MON_INT2                *((volatile  uint8_t *)(0x42624F88UL))

#define bFM_INTREQ_IRQ31MON_INT0                  *((volatile  uint8_t *)(0x42625000UL))
#define bFM0P_INTREQ_IRQ31MON_INT0                *((volatile  uint8_t *)(0x42625000UL))
#define bFM_INTREQ_IRQ31MON_INT1                  *((volatile  uint8_t *)(0x42625004UL))
#define bFM0P_INTREQ_IRQ31MON_INT1                *((volatile  uint8_t *)(0x42625004UL))
#define bFM_INTREQ_IRQ31MON_INT2                  *((volatile  uint8_t *)(0x42625008UL))
#define bFM0P_INTREQ_IRQ31MON_INT2                *((volatile  uint8_t *)(0x42625008UL))

#define bFM_INTREQ_ODDPKS_ODDPKS0                 *((volatile  uint8_t *)(0x42620200UL))
#define bFM0P_INTREQ_ODDPKS_ODDPKS0               *((volatile  uint8_t *)(0x42620200UL))
#define bFM_INTREQ_ODDPKS_ODDPKS1                 *((volatile  uint8_t *)(0x42620204UL))
#define bFM0P_INTREQ_ODDPKS_ODDPKS1               *((volatile  uint8_t *)(0x42620204UL))
#define bFM_INTREQ_ODDPKS_ODDPKS2                 *((volatile  uint8_t *)(0x42620208UL))
#define bFM0P_INTREQ_ODDPKS_ODDPKS2               *((volatile  uint8_t *)(0x42620208UL))
#define bFM_INTREQ_ODDPKS_ODDPKS3                 *((volatile  uint8_t *)(0x4262020CUL))
#define bFM0P_INTREQ_ODDPKS_ODDPKS3               *((volatile  uint8_t *)(0x4262020CUL))
#define bFM_INTREQ_ODDPKS_ODDPKS4                 *((volatile  uint8_t *)(0x42620210UL))
#define bFM0P_INTREQ_ODDPKS_ODDPKS4               *((volatile  uint8_t *)(0x42620210UL))


/*******************************************************************************
* LSCRP Registers LSCRP
*   Bitband Section
*******************************************************************************/

/*******************************************************************************
* LVD Registers LVD
*   Bitband Section
*******************************************************************************/
#define bFM_LVD_LVD_CLR_LVDCL                     *((volatile  uint8_t *)(0x426A011CUL))
#define bFM0P_LVD_LVD_CLR_LVDCL                   *((volatile  uint8_t *)(0x426A011CUL))
#define bFM_LVD_LVD_CLR_LVD2CL                    *((volatile  uint8_t *)(0x426A013CUL))
#define bFM0P_LVD_LVD_CLR_LVD2CL                  *((volatile  uint8_t *)(0x426A013CUL))

